import { MockMethod } from "vite-plugin-mock";

// 中通快运  青海用的宁夏数据
export default [
  {
    url: "/getPrice",
    method: "get",
    response: () => {
      return {
        code: 0,
        data: [
          {
            name: "百世快运",
            weight: 3,
            data: [
              {
                label: "北京",
                level: "1",
                code: "1100",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 20],
                  [60, 1.5]
                ]
              },
              {
                label: "天津",
                level: "1",
                code: "1200",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 20],
                  [60, 1.5]
                ]
              },
              {
                label: "河北",
                level: "1",
                code: "1300",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 20],
                  [60, 1.5]
                ]
              },
              {
                label: "山西",
                level: "1",
                code: "1400",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 20],
                  [60, 1.6]
                ]
              },
              {
                label: "内蒙古自治区",
                level: "1",
                code: "1500",
                price: [
                  [0, 3, 25],
                  [3, 60, 2.5, 25],
                  [60, 2.4]
                ]
              },
              {
                label: "辽宁",
                level: "1",
                code: "2100",
                price: [
                  [0, 3, 25],
                  [3, 60, 1.9, 25],
                  [60, 1.9]
                ]
              },
              {
                label: "吉林",
                level: "1",
                code: "2200",
                price: [
                  [0, 3, 25],
                  [3, 60, 2, 25],
                  [60, 2]
                ]
              },
              {
                label: "黑龙江",
                level: "1",
                code: "2300",
                price: [
                  [0, 3, 25],
                  [3, 60, 2.3, 25],
                  [60, 2.2]
                ]
              },
              {
                label: "上海",
                level: "1",
                code: "3100",
                price: [
                  [0, 3, 18],
                  [3, 60, 1.3, 18],
                  [60, 1.3]
                ]
              },
              {
                label: "江苏",
                level: "1",
                code: "3200",
                price: [
                  [0, 3, 18],
                  [3, 60, 1.3, 18],
                  [60, 1.3]
                ]
              },
              {
                label: "浙江",
                level: "1",
                code: "3300",
                price: [
                  [0, 3, 18],
                  [3, 60, 1.3, 18],
                  [60, 1.3]
                ]
              },
              {
                label: "安徽",
                level: "1",
                code: "3400",
                price: [
                  [0, 3, 18],
                  [3, 60, 1.45, 18],
                  [60, 1.35]
                ]
              },
              {
                label: "福建",
                level: "1",
                code: "3500",
                price: [
                  [0, 3, 18],
                  [3, 60, 1.3, 18],
                  [60, 1.3]
                ]
              },
              {
                label: "江西",
                level: "1",
                code: "3600",
                price: [
                  [0, 3, 18],
                  [3, 60, 1.3, 18],
                  [60, 1.3]
                ]
              },
              {
                label: "山东",
                level: "1",
                code: "3700",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 20],
                  [60, 1.6]
                ]
              },
              {
                label: "河南",
                level: "1",
                code: "4100",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 20],
                  [60, 1.5]
                ]
              },
              {
                label: "湖北",
                level: "1",
                code: "4200",
                price: [
                  [0, 3, 18],
                  [3, 60, 1.45, 18],
                  [60, 1.35]
                ]
              },
              {
                label: "湖南",
                level: "1",
                code: "4300",
                price: [
                  [0, 3, 18],
                  [3, 60, 1.45, 18],
                  [60, 1.35]
                ]
              },
              {
                label: "广东",
                level: "1",
                code: "4400",
                price: [
                  [0, 3, 15],
                  [3, 60, 0.8, 15],
                  [60, 0.7]
                ]
              },
              {
                label: "广西",
                level: "1",
                code: "4500",
                price: [
                  [0, 3, 18],
                  [3, 60, 1.3, 18],
                  [60, 1.3]
                ]
              },
              {
                label: "海南",
                level: "1",
                code: "4600",
                price: []
              },
              {
                label: "重庆",
                level: "1",
                code: "5000",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 20],
                  [60, 1.6]
                ]
              },
              {
                label: "四川",
                level: "1",
                code: "5100",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 20],
                  [60, 1.6]
                ]
              },
              {
                label: "贵州",
                level: "1",
                code: "5200",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 25],
                  [60, 1.6]
                ]
              },
              {
                label: "云南",
                level: "1",
                code: "5300",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.7, 20],
                  [60, 1.6]
                ]
              },
              {
                label: "西藏自治区",
                level: "1",
                code: "5400",
                price: [
                  [0, 3, 30],
                  [3, 60, 4.5, 30],
                  [60, 4.5]
                ]
              },
              {
                label: "陕西",
                level: "1",
                code: "6100",
                price: [
                  [0, 3, 20],
                  [3, 60, 1.6, 20],
                  [60, 1.5]
                ]
              },
              {
                label: "甘肃",
                level: "1",
                code: "6200",
                price: [
                  [0, 3, 35],
                  [3, 60, 2.6, 35],
                  [60, 2.5]
                ]
              },
              {
                label: "青海",
                level: "1",
                code: "6300",
                price: [
                  [0, 3, 35],
                  [3, 60, 2.6, 35],
                  [60, 2.6]
                ]
              },
              {
                label: "宁夏回族自治区",
                level: "1",
                code: "6400",
                price: [
                  [0, 3, 25],
                  [3, 60, 2.5, 25],
                  [60, 2.5]
                ]
              },
              {
                label: "新疆维吾尔自治区",
                level: "1",
                code: "6500",
                price: [
                  [0, 3, 35],
                  [3, 60, 2.7, 35],
                  [60, 2.6]
                ]
              }
            ]
          },
          {
            name: "中通快运",
            weight: 25,
            data: [
              {
                label: "北京",
                level: "1",
                code: "1100",
                price: [
                  [0, 24, 50],
                  [25, 200, 1.5],
                  [201, 300, 1.4],
                  [301, 800, 1.3]
                ]
              },
              {
                label: "天津",
                level: "1",
                code: "1200",
                price: [
                  [0, 24, 45],
                  [25, 200, 1.5],
                  [201, 300, 1.4],
                  [301, 800, 1.3]
                ]
              },
              {
                label: "河北",
                level: "1",
                code: "1300",
                price: [
                  [0, 24, 45],
                  [25, 200, 1.5],
                  [201, 300, 1.4],
                  [301, 800, 1.3]
                ]
              },
              {
                label: "山西",
                level: "1",
                code: "1400",
                price: [
                  [0, 24, 50],
                  [25, 200, 1.5],
                  [201, 300, 1.4],
                  [301, 800, 1.3]
                ]
              },
              {
                label: "内蒙古自治区",
                level: "1",
                code: "1500",
                price: [
                  [0, 24, 70],
                  [25, 200, 3.2],
                  [201, 300, 3.1],
                  [301, 800, 3]
                ]
              },
              {
                label: "辽宁",
                level: "1",
                code: "2100",
                price: [
                  [0, 24, 55],
                  [25, 200, 2],
                  [201, 300, 1.9],
                  [301, 800, 1.8]
                ]
              },
              {
                label: "吉林",
                level: "1",
                code: "2200",
                price: [
                  [0, 24, 55],
                  [25, 200, 1.8],
                  [201, 300, 1.7],
                  [301, 800, 1.5]
                ]
              },
              {
                label: "黑龙江",
                level: "1",
                code: "2300",
                price: [
                  [0, 24, 55],
                  [25, 200, 2],
                  [201, 300, 1.9],
                  [301, 800, 1.8]
                ]
              },
              {
                label: "上海",
                level: "1",
                code: "3100",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.1],
                  [201, 300, 1],
                  [301, 800, 0.9]
                ]
              },
              {
                label: "江苏",
                level: "1",
                code: "3200",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.1],
                  [201, 300, 1],
                  [301, 800, 0.9]
                ]
              },
              {
                label: "浙江",
                level: "1",
                code: "3300",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.1],
                  [201, 300, 1],
                  [301, 800, 0.9]
                ]
              },
              {
                label: "安徽",
                level: "1",
                code: "3400",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.3],
                  [201, 300, 1.2],
                  [301, 800, 1.1]
                ]
              },
              {
                label: "福建",
                level: "1",
                code: "3500",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.1],
                  [201, 300, 1],
                  [301, 800, 0.9]
                ]
              },
              {
                label: "江西",
                level: "1",
                code: "3600",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.1],
                  [201, 300, 1],
                  [301, 800, 0.9]
                ]
              },
              {
                label: "山东",
                level: "1",
                code: "3700",
                price: [
                  [0, 24, 45],
                  [25, 200, 1.5],
                  [201, 300, 1.4],
                  [301, 800, 1.3]
                ]
              },
              {
                label: "河南",
                level: "1",
                code: "4100",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.4],
                  [201, 300, 1.3],
                  [301, 800, 1.2]
                ]
              },
              {
                label: "湖北",
                level: "1",
                code: "4200",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.3],
                  [201, 300, 1.2],
                  [301, 800, 1.1]
                ]
              },
              {
                label: "湖南",
                level: "1",
                code: "4300",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.2],
                  [201, 300, 1.1],
                  [301, 800, 1]
                ]
              },
              {
                label: "广东",
                level: "1",
                code: "4400",
                price: [
                  [0, 15, 25],
                  [16, 50, 0.8],
                  [51, 300, 0.7],
                  [301, 1000, 0.65]
                ]
              },
              {
                label: "广西",
                level: "1",
                code: "4500",
                price: [
                  [0, 24, 40],
                  [25, 200, 1.1],
                  [201, 300, 1],
                  [301, 800, 0.9]
                ]
              },
              {
                label: "海南",
                level: "1",
                code: "4600",
                price: []
              },
              {
                label: "重庆",
                level: "1",
                code: "5000",
                price: [
                  [0, 24, 45],
                  [25, 200, 1.5],
                  [201, 300, 1.4],
                  [301, 800, 1.3]
                ]
              },
              {
                label: "四川",
                level: "1",
                code: "5100",
                price: [
                  [0, 24, 45],
                  [25, 200, 1.5],
                  [201, 300, 1.4],
                  [301, 800, 1.3]
                ]
              },
              {
                label: "贵州",
                level: "1",
                code: "5200",
                price: [
                  [0, 24, 45],
                  [25, 200, 1.5],
                  [201, 300, 1.4],
                  [301, 800, 1.3]
                ]
              },
              {
                label: "云南",
                level: "1",
                code: "5300",
                price: [
                  [0, 24, 45],
                  [25, 200, 1.5],
                  [201, 300, 1.4],
                  [301, 800, 1.3]
                ]
              },
              {
                label: "西藏自治区",
                level: "1",
                code: "5400",
                price: [
                  [0, 24, 70],
                  [25, 200, 4],
                  [201, 300, 3.9],
                  [301, 800, 3.7]
                ]
              },
              {
                label: "陕西",
                level: "1",
                code: "6100",
                price: [
                  [0, 24, 55],
                  [25, 200, 1.6],
                  [201, 300, 1.5],
                  [301, 800, 1.4]
                ]
              },
              {
                label: "甘肃",
                level: "1",
                code: "6200",
                price: [
                  [0, 24, 55],
                  [25, 200, 2.2],
                  [201, 300, 2.1],
                  [301, 800, 2]
                ]
              },
              {
                label: "青海",
                level: "1",
                code: "6300",
                price: [
                  [0, 24, 50],
                  [25, 200, 2.5],
                  [201, 300, 2.4],
                  [301, 800, 2.3]
                ]
              },
              {
                label: "宁夏回族自治区",
                level: "1",
                code: "6400",
                price: [
                  [0, 24, 50],
                  [25, 200, 2.5],
                  [201, 300, 2.4],
                  [301, 800, 2.3]
                ]
              },
              {
                label: "新疆维吾尔自治区",
                level: "1",
                code: "6500",
                price: [
                  [0, 24, 70],
                  [25, 200, 4],
                  [201, 300, 3.9],
                  [301, 800, 3.7]
                ]
              }
            ]
          }
        ]
      };
    }
  }
] as MockMethod[];

// { label: "北京", level: "1", code: "1100" },
// { label: "天津", level: "1", code: "1200" },
// { label: "河北", level: "1", code: "1300" },
// { label: "山西", level: "1", code: "1400" },
// { label: "内蒙古自治区", level: "1", code: "1500" },
// { label: "辽宁", level: "1", code: "2100" },
// { label: "吉林", level: "1", code: "2200" },
// { label: "黑龙江", level: "1", code: "2300" },
// { label: "上海", level: "1", code: "3100" },
// { label: "江苏", level: "1", code: "3200" },
// { label: "浙江", level: "1", code: "3300" },
// { label: "安徽", level: "1", code: "3400" },
// { label: "福建", level: "1", code: "3500" },
// { label: "江西", level: "1", code: "3600" },
// { label: "山东", level: "1", code: "3700" },
// { label: "河南", level: "1", code: "4100" },
// { label: "湖北", level: "1", code: "4200" },
// { label: "湖南", level: "1", code: "4300" },
// { label: "广东", level: "1", code: "4400" },
// { label: "广西壮族自治区", level: "1", code: "4500" },
// { label: "海南", level: "1", code: "4600" },
// { label: "重庆", level: "1", code: "5000" },
// { label: "四川", level: "1", code: "5100" },
// { label: "贵州", level: "1", code: "5200" },
// { label: "云南", level: "1", code: "5300" },
// { label: "西藏自治区", level: "1", code: "5400" },
// { label: "陕西", level: "1", code: "6100" },
// { label: "甘肃", level: "1", code: "6200" },
// { label: "青海", level: "1", code: "6300" },
// { label: "宁夏回族自治区", level: "1", code: "6400" },
// { label: "新疆维吾尔自治区", level: "1", code: "6500" }
